Performance.yml
---

execution:
- concurrency: 50
  hold-for: 1m
  ramp-up: 20s
  scenario: perftest
scenarios:
  perftest:
    headers:
     Content-Type: application/json
     Host: weeu-s05-tst-ams-dspublisherapi-01.azure-api.net
     Origin: https://weeu-s05-tst-ams-dspublisherapi-01.azure-api.net/DataScience/V2
     Referer: https://weeu-s05-tst-ams-dspublisherapi-01.azure-api.net/DataScience/V2
     Ocp-Apim-Subscription-Key: d733e00132234a52977a12a705a9ed28
    requests:
    - label: Test Performance Singlekey
      method: POST
      url: https://weeu-s05-tst-ams-dspublisherapi-01.azure-api.net/DataScience/V2
      body:
        sessionId:  singlekey
        modelName:  0.0.1
        identifiers:
          name: primary
          value:  Webshop_Id
reporting:
- module: blazemeter
  token: a74cd31f94247b69a1193855:0b0a3d4043012af6d355f7f12409c06ab3a777c5bdb45273cb923dbdea322f209af56baa
  report-name: AH API Performance Test
  test: perftest
  project: AH
- module: junit-xml
  filename: outputxunit.xml
  data-source: sample-labels
- module: console