Performance.yml
---

execution:
- concurrency: 50
  hold-for: 1m
  ramp-up: 20s
  scenario: perftest
scenarios:
  perftest:
    headers:
     Content-Type: application/json
     Host: weeu-s05-tst-ams-dspublisherapi-01.azure-api.net
     Origin: https://weeu-s05-tst-ams-dspublisherapi-01.azure-api.net/DataScience/V2
     Referer: https://weeu-s05-tst-ams-dspublisherapi-01.azure-api.net/DataScience/V2
     Ocp-Apim-Subscription-Key: d733e00132234a52977a12a705a9ed28
    requests:
    - label: Test Performance Singlekey
      method: POST
      url: https://weeu-s05-tst-ams-dspublisherapi-01.azure-api.net/DataScience/V2
      body:
        sessionId:  singlekey
        modelName:  0.0.1
        identifiers:
          name: primary
          value:  Webshop_Id
reporting:
- module: console
- module: final-stats
  summary: true  # overall samples count and percent of failures
  percentiles: true  # display average times and percentiles
  failed-labels: true  # provides list of sample labels with failures
  test-duration: true  # provides test duration
  dump-csv: /Users/harpreetsingh/Documents/PoR/PerformanceTests/Portmaps_perf_result_csv.csv
- module: blazemeter
  token: a74cd31f94247b69a1193855:59edbf557f70fb94c0c41590a17bf82e67c269c3a850e2fc4dd7e00a442ccf3549e67394
  report-name: AH API Performance Test
  test: perftest
  project: AH